{
  "metadata": {
    "timestamp": "2025-09-22T23:15:47.130487",
    "collector": "fast_corpus_collector",
    "count": 3,
    "quality_score": 0.9
  },
  "documents": [
    {
      "title": "Verb",
      "content": "A verb is a word that generally conveys an action, an occurrence, or a state of being. In the usual description of English, the basic form, with or without the particle to, is the infinitive. In many languages, verbs are inflected to encode tense, aspect, mood, and voice. A verb may also agree with the person, gender or number of some of its arguments, such as its subject, or object. In English, three tenses exist: present, to indicate that an action is being carried out; past, to indicate that an action has been done; and future, to indicate that an action will be done, expressed with the auxiliary verb will or shall.",
      "source": "wikipedia_en",
      "url": "https://en.wikipedia.org/wiki/Verb",
      "timestamp": "2025-09-22T23:15:41.997197"
    },
    {
      "title": "Language",
      "content": "Language is a structured system of communication that consists of grammar and vocabulary. It is the primary means by which humans convey meaning, both in spoken and signed forms, and may also be conveyed through writing. Human language is characterized by its cultural and historical diversity, with significant variations observed between cultures and across time. Human languages possess the properties of productivity and displacement, which enable the creation of an infinite number of sentences, and the ability to refer to objects, events, and ideas that are not immediately present in the discourse. The use of human language relies on social convention and is acquired through learning.",
      "source": "wikipedia_en",
      "url": "https://en.wikipedia.org/wiki/Language",
      "timestamp": "2025-09-22T23:15:44.065746"
    },
    {
      "title": "Phonetics",
      "content": "Phonetics is a branch of linguistics that studies how humans produce and perceive sounds or, in the case of sign languages, the equivalent aspects of sign. Linguists who specialize in studying the physical properties of speech are phoneticians. The field of phonetics is traditionally divided into three sub-disciplines: articulatory phonetics, acoustic phonetics, and auditory phonetics. Traditionally, the minimal linguistic unit of phonetics is the phone—a speech sound in a language which differs from the phonological unit of phoneme; the phoneme is an abstract categorization of phones and it is also defined as the smallest unit that discerns meaning between sounds in any given language.",
      "source": "wikipedia_en",
      "url": "https://en.wikipedia.org/wiki/Phonetics",
      "timestamp": "2025-09-22T23:15:46.129874"
    }
  ]
}