{
  "metadata": {
    "timestamp": "2025-09-22T23:53:32.850217",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 15,
    "avg_quality_score": 0.757,
    "avg_dhatu_potential": 0.047,
    "sources_used": [
      "wikipedia_linguistics",
      "wikipedia_sanskrit",
      "wikipedia_philosophy"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Grammar",
      "content": "In linguistics, grammar is the set of rules for how a natural language is structured, as demonstrated by its speakers or writers. Grammar rules may concern the use of clauses, phrases, and words. The term may also refer to the study of such rules, a subject that includes phonology, morphology, and syntax, together with phonetics, semantics, and pragmatics. There are, broadly speaking, two different ways to study grammar: traditional grammar and theoretical grammar.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Grammar",
      "timestamp": "2025-09-22T23:53:32.616982",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Syntax",
      "content": "In linguistics, syntax is the study of how words and morphemes combine to form larger units such as phrases and sentences. Central concerns of syntax include word order, grammatical relations, hierarchical sentence structure (constituency), agreement, the nature of crosslinguistic variation, and the relationship between form and meaning (semantics). Diverse approaches, such as generative grammar and functional grammar, offer unique perspectives on syntax, reflecting its complexity and centrality to understanding human language.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:53:32.744321",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Dhātu",
      "content": "Dhātu est un mot sanskrit signifiant élément, partie d'un tout; racine verbale. Dans le bouddhisme ce sont les quatre éléments physiques (bhūta) constitutifs de la matière. Leur analyse englobe les phénomènes physiques et partiellement mentaux sous forme de dix-huit éléments. En grammaire sanskrite, le terme désigne les racines verbales.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Dh%C4%81tu",
      "timestamp": "2025-09-22T23:53:32.682292",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.9,
      "dhatu_potential": 0.1
    },
    {
      "title": "Phonology",
      "content": "Phonology is the branch of linguistics that studies how languages systematically organize their phonemes or, for sign languages, their constituent parts of signs. The term can also refer specifically to the sound or sign system of a particular language variety. At one time, the study of phonology related only to the study of the systems of phonemes in spoken languages, but now it may relate to any linguistic analysis either:",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Phonology",
      "timestamp": "2025-09-22T23:53:32.770376",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.1
    },
    {
      "title": "Dhatu",
      "content": "Dhātu may refer to:Dhātu (ayurveda) – Sanskrit term for the seven fundamental elements of the body\nSkandha#Eighteen dhātus and four paramatthas – a Sanskrit technical term meaning realm or substrate in Buddhism\nA term used to denote the classical elements in Indian thought\nA Theravada Buddhist term for a stupa, a mound-like structure containing Buddhist relics\n\n",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Dhatu",
      "timestamp": "2025-09-22T23:53:32.667111",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Verb",
      "content": "A verb is a word that generally conveys an action, an occurrence, or a state of being. In the usual description of English, the basic form, with or without the particle to, is the infinitive. In many languages, verbs are inflected to encode tense, aspect, mood, and voice. A verb may also agree with the person, gender or number of some of its arguments, such as its subject, or object. In English, three tenses exist: present, to indicate that an action is being carried out; past, to indicate that an action has been done; and future, to indicate that an action will be done, expressed with the auxiliary verb will or shall.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Verb",
      "timestamp": "2025-09-22T23:53:32.694601",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.5
    },
    {
      "title": "Sanskrit",
      "content": "Le sanskrit ou sanscrit est une langue indo-européenne de la famille indo-aryenne, encore parlée dans le sous-continent indien bien que par une minorité. De nos jours, elle est encore parlée dans quelques villages et par certains érudits qui publient des œuvres universitaires ou tiennent des colloques en sanskrit.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:53:32.824139",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sanskrit",
      "content": "Sanskrit is a classical language belonging to the Indo-Aryan branch of the Indo-European languages. It arose in northwest South Asia after its predecessor languages had diffused there from the northwest in the late Bronze Age. Sanskrit is the sacred language of Hinduism, the language of classical Hindu philosophy, and of historical texts of Buddhism and Jainism. It was a link language in ancient and medieval South Asia, and upon transmission of Hindu and Buddhist culture to Southeast Asia, East Asia and Central Asia in the early medieval era, it became a language of religion and high culture, and of the political elites in some of these regions. As a result, Sanskrit had a lasting effect on the languages of South Asia, Southeast Asia and East Asia, especially in their formal and learned vocabularies.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:53:32.818243",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Mahabharata",
      "content": "Le Mahabharata est une épopée sanskrite (itihâsa) de la mythologie hindoue comportant, selon le décompte de Vyâsa, 81 936 strophes (shlokas) réparties en dix-huit livres (parvan). Il est considéré comme le plus long poème jamais composé.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Mahabharata",
      "timestamp": "2025-09-22T23:53:32.782143",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Syntax",
      "content": "Syntax est un groupe de musique britannique basé à Londres. Formé autour des musiciens Jan Burton et Mike Tournier, le groupe emprunte sa musique comme un son Rock en fusionnant l'Electro et le Trip hop. Ils ont participé à plusieurs projets musicaux comme dans une apparition dans la B.O du jeu vidéo Driver 3, en plus de leurs divers projets individuels comme leur album Meccano Mind sorti en 2004.",
      "source": "wikipedia_linguistics_fr",
      "url": "https://fr.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:53:32.733241",
      "language": "fr",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Philosophy of language",
      "content": "Philosophy of language refers to the philosophical study of the nature of language. It investigates the relationship between language, language users, and the world. Investigations may include inquiry into the nature of meaning, intentionality, reference, the constitution of sentences, concepts, learning, and thought.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Philosophy_of_language",
      "timestamp": "2025-09-22T23:53:32.690147",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Vyakarana",
      "content": "Vyākaraṇa signifie en sanskrit « séparation », « distinction » ou encore« analyse ». Vyākaraṇa désigne aussi l'une des six disciplines annexes du Veda (Vedāṅga): la grammaire.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Vyakarana",
      "timestamp": "2025-09-22T23:53:32.735519",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.65,
      "dhatu_potential": 0.0
    },
    {
      "title": "Mahabharata",
      "content": "The Mahābhārata is a smriti text from ancient India, one of the two important epics of Hinduism known as the Itihasas, the other being the Ramayana. It narrates the events and aftermath of the Kurukshetra War, a war of succession between two groups of princely cousins, the Kauravas and the Pāṇḍavas. It contains philosophical and devotional material, such as a discussion of the four \"goals of life\" or puruṣārtha (12.161). Among the principal works and stories in the Mahābhārata are the Bhagavad Gita, the story of Damayanti, the story of Shakuntala, the story of Pururava and Urvashi, the story of Savitri and Satyavan, the story of Kacha and Devayani, the story of Rishyasringa and an abbreviated version of the Rāmāyaṇa, often considered as works in their own right.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Mahabharata",
      "timestamp": "2025-09-22T23:53:32.771993",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Ancient philosophy",
      "content": "This page lists some links to ancient philosophy, namely philosophical thought extending as far as early post-classical history.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Ancient_philosophy",
      "timestamp": "2025-09-22T23:53:32.632322",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sánscrito",
      "content": "El sánscrito es la lengua clásica de la India, además de una de las lenguas indoeuropeas documentadas más antiguas, después del hitita y el griego micénico. El sánscrito pertenece a la subfamilia indoeuropea de las lenguas indoiranias y específicamente la indoaria.",
      "source": "wikipedia_sanskrit_es",
      "url": "https://es.wikipedia.org/wiki/S%C3%A1nscrito",
      "timestamp": "2025-09-22T23:53:32.847226",
      "language": "es",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}