{
  "metadata": {
    "timestamp": "2025-09-22T23:52:24.086090",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 14,
    "avg_quality_score": 0.718,
    "avg_dhatu_potential": 0.057,
    "sources_used": [
      "wikipedia_linguistics",
      "wikipedia_sanskrit",
      "wikipedia_philosophy"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Grammar",
      "content": "In linguistics, grammar is the set of rules for how a natural language is structured, as demonstrated by its speakers or writers. Grammar rules may concern the use of clauses, phrases, and words. The term may also refer to the study of such rules, a subject that includes phonology, morphology, and syntax, together with phonetics, semantics, and pragmatics. There are, broadly speaking, two different ways to study grammar: traditional grammar and theoretical grammar.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Grammar",
      "timestamp": "2025-09-22T23:52:23.914232",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Etymology",
      "content": "Etymology is the study of the origin and evolution of words—including their constituent units of sound and meaning—across time. In the 21st century a subfield within linguistics, etymology has become a more rigorously scientific study. Most directly tied to historical linguistics, philology, and semiotics, it additionally draws upon comparative semantics, morphology, pragmatics, and phonetics in order to attempt a comprehensive and chronological catalogue of all meanings and changes that a word carries throughout its history. The origin of any particular word is also known as its etymology.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Etymology",
      "timestamp": "2025-09-22T23:52:23.843307",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sanskrit",
      "content": "Sanskrit bezeichnet die verschiedenen Varietäten des Altindischen. Die älteste Form ist die Sprache der Veden, einer Sammlung religiöser mündlicher Überlieferungen im Hinduismus. Ihre Entstehung und Konsolidierung wird grob auf 1200 v. Chr. datiert, jedenfalls ins zweite vorchristliche Jahrtausend. Das klassische Sanskrit wurde um 400 v. Chr. durch die Grammatik des Panini kodifiziert.",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:52:24.039601",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.8,
      "dhatu_potential": 0.0
    },
    {
      "title": "Root",
      "content": "In vascular plants, the roots are the organs of a plant that are modified to provide anchorage for the plant and take in water and nutrients into the plant body, which allows plants to grow taller and faster. They are most often below the surface of the soil, but roots can also be aerial or aerating, that is, growing up above the ground or especially above water.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Root",
      "timestamp": "2025-09-22T23:52:23.876613",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.1
    },
    {
      "title": "Sanskrit",
      "content": "Sanskrit is a classical language belonging to the Indo-Aryan branch of the Indo-European languages. It arose in northwest South Asia after its predecessor languages had diffused there from the northwest in the late Bronze Age. Sanskrit is the sacred language of Hinduism, the language of classical Hindu philosophy, and of historical texts of Buddhism and Jainism. It was a link language in ancient and medieval South Asia, and upon transmission of Hindu and Buddhist culture to Southeast Asia, East Asia and Central Asia in the early medieval era, it became a language of religion and high culture, and of the political elites in some of these regions. As a result, Sanskrit had a lasting effect on the languages of South Asia, Southeast Asia and East Asia, especially in their formal and learned vocabularies.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:52:23.999382",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Verb",
      "content": "A verb is a word that generally conveys an action, an occurrence, or a state of being. In the usual description of English, the basic form, with or without the particle to, is the infinitive. In many languages, verbs are inflected to encode tense, aspect, mood, and voice. A verb may also agree with the person, gender or number of some of its arguments, such as its subject, or object. In English, three tenses exist: present, to indicate that an action is being carried out; past, to indicate that an action has been done; and future, to indicate that an action will be done, expressed with the auxiliary verb will or shall.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Verb",
      "timestamp": "2025-09-22T23:52:23.987359",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.5
    },
    {
      "title": "Philosophy of language",
      "content": "Philosophy of language refers to the philosophical study of the nature of language. It investigates the relationship between language, language users, and the world. Investigations may include inquiry into the nature of meaning, intentionality, reference, the constitution of sentences, concepts, learning, and thought.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Philosophy_of_language",
      "timestamp": "2025-09-22T23:52:23.927922",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Logic",
      "content": "Logic, de son vrai nom Sir Robert Bryson Hall II, né le 22 janvier 1990 à Gaithersburg dans le Maryland, est un rappeur américain.\nIl compte beaucoup de followers sur Internet et est membre du RattPack, un groupe d'amis avec lequel il travaille. Il publie officiellement quatre mixtapes, ainsi que trois albums studio. Membre des labels Visionary Music Group et Def Jam Records, il publie son premier album solo intitulé Under Pressure le 21 octobre 2014.",
      "source": "wikipedia_philosophy_fr",
      "url": "https://fr.wikipedia.org/wiki/Logic",
      "timestamp": "2025-09-22T23:52:23.892161",
      "language": "fr",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Epistemology",
      "content": "\n\nEpistemology is the branch of philosophy that examines the nature, origin, and limits of knowledge. Also called \"the theory of knowledge\", it explores different types of knowledge, such as propositional knowledge about facts, practical knowledge in the form of skills, and knowledge by acquaintance as a familiarity through experience. Epistemologists study the concepts of belief, truth, and justification to understand the nature of knowledge. To discover how knowledge arises, they investigate sources of justification, such as perception, introspection, memory, reason, and testimony.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Epistemology",
      "timestamp": "2025-09-22T23:52:23.888249",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.1
    },
    {
      "title": "Panini",
      "content": "Panini puede hacer referencia a:El panini (sándwich), variedad de sándwich de origen italiano.\nLa editorial Panini, editorial italiana fundada en 1961.\nPanini (gramático), gramático del sánscrito de la India antigua.\nGiovanni Pannini (1691-1756), pintor y arquitecto italiano.",
      "source": "wikipedia_sanskrit_es",
      "url": "https://es.wikipedia.org/wiki/Panini",
      "timestamp": "2025-09-22T23:52:24.083087",
      "language": "es",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.65,
      "dhatu_potential": 0.0
    },
    {
      "title": "Ancient philosophy",
      "content": "This page lists some links to ancient philosophy, namely philosophical thought extending as far as early post-classical history.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Ancient_philosophy",
      "timestamp": "2025-09-22T23:52:23.957982",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Upanishad",
      "content": "Les Upanishad ou Upaniṣad sont un ensemble de textes philosophiques qui forment la base théorique de la religion hindoue. Elles constituent une partie des textes en Inde liés à la śruti et consistent en des spéculations philosophiques qui éclairent le texte auquel elles se réfèrent, chacune se réclamant d'une partie du Veda. Par exemple, la Kauṣītaki fait partie du cycle du Rig-Veda.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Upanishad",
      "timestamp": "2025-09-22T23:52:23.870514",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Root",
      "content": "Root ist der Name folgender Orte:Root LU, Gemeinde im Kanton Luzern, Schweiz\nRoot, Ort im Montgomery County",
      "source": "wikipedia_linguistics_de",
      "url": "https://de.wikipedia.org/wiki/Root",
      "timestamp": "2025-09-22T23:52:23.905995",
      "language": "de",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.55,
      "dhatu_potential": 0.1
    },
    {
      "title": "Puranas",
      "content": "Die Puranas gehören zu den wichtigsten heiligen Schriften des Hinduismus. Sie sind nach den Veden in der Zeit von 400 n. Chr. bis 1000 n. Chr. entstanden, greifen jedoch oft auf ältere Inhalte zurück.",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Puranas",
      "timestamp": "2025-09-22T23:52:23.931389",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}