{
  "metadata": {
    "timestamp": "2025-09-22T23:26:11.866273",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 14,
    "avg_quality_score": 0.743,
    "avg_dhatu_potential": 0.0,
    "sources_used": [
      "wikipedia_philosophy",
      "wikipedia_linguistics",
      "wikipedia_sanskrit"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Etymology",
      "content": "Etymology is the study of the origin and evolution of words—including their constituent units of sound and meaning—across time. In the 21st century a subfield within linguistics, etymology has become a more rigorously scientific study. Most directly tied to historical linguistics, philology, and semiotics, it additionally draws upon comparative semantics, morphology, pragmatics, and phonetics in order to attempt a comprehensive and chronological catalogue of all meanings and changes that a word carries throughout its history. The origin of any particular word is also known as its etymology.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Etymology",
      "timestamp": "2025-09-22T23:26:11.653602",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Syntax",
      "content": "In linguistics, syntax is the study of how words and morphemes combine to form larger units such as phrases and sentences. Central concerns of syntax include word order, grammatical relations, hierarchical sentence structure (constituency), agreement, the nature of crosslinguistic variation, and the relationship between form and meaning (semantics). Diverse approaches, such as generative grammar and functional grammar, offer unique perspectives on syntax, reflecting its complexity and centrality to understanding human language.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:26:11.791760",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Philology",
      "content": "Philology is the study of language in oral and written historical sources. It is the intersection of textual criticism, literary criticism, history, and linguistics with strong ties to etymology. Philology is also defined as the study of literary texts and oral and written records, the establishment of their authenticity and their original form, and the determination of their meaning. A person who pursues this kind of study is known as a philologist. In older usage, especially British, philology is more general, covering comparative and historical linguistics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Philology",
      "timestamp": "2025-09-22T23:26:11.701622",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Dhatu",
      "content": "Dhātu may refer to:Dhātu (ayurveda) – Sanskrit term for the seven fundamental elements of the body\nSkandha#Eighteen dhātus and four paramatthas – a Sanskrit technical term meaning realm or substrate in Buddhism\nA term used to denote the classical elements in Indian thought\nA Theravada Buddhist term for a stupa, a mound-like structure containing Buddhist relics\n\n",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Dhatu",
      "timestamp": "2025-09-22T23:26:11.725890",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Upanishads",
      "content": "The Upanishads are late Vedic and post-Vedic Sanskrit texts that \"document the transition from the archaic ritualism of the Veda into new religious ideas and institutions\" and the emergence of the central religious concepts of Hinduism. They are the most recent addition to the Vedas, the oldest scriptures of Hinduism, and deal with meditation, philosophy, consciousness, and ontological knowledge. Earlier parts of the Vedas dealt with mantras, benedictions, rituals, ceremonies, and sacrifices.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Upanishads",
      "timestamp": "2025-09-22T23:26:11.666369",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sanskrit",
      "content": "Sanskrit is a classical language belonging to the Indo-Aryan branch of the Indo-European languages. It arose in northwest South Asia after its predecessor languages had diffused there from the northwest in the late Bronze Age. Sanskrit is the sacred language of Hinduism, the language of classical Hindu philosophy, and of historical texts of Buddhism and Jainism. It was a link language in ancient and medieval South Asia, and upon transmission of Hindu and Buddhist culture to Southeast Asia, East Asia and Central Asia in the early medieval era, it became a language of religion and high culture, and of the political elites in some of these regions. As a result, Sanskrit had a lasting effect on the languages of South Asia, Southeast Asia and East Asia, especially in their formal and learned vocabularies.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:26:11.792074",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Syntax",
      "content": "Syntax est un groupe de musique britannique basé à Londres. Formé autour des musiciens Jan Burton et Mike Tournier, le groupe emprunte sa musique comme un son Rock en fusionnant l'Electro et le Trip hop. Ils ont participé à plusieurs projets musicaux comme dans une apparition dans la B.O du jeu vidéo Driver 3, en plus de leurs divers projets individuels comme leur album Meccano Mind sorti en 2004.",
      "source": "wikipedia_linguistics_fr",
      "url": "https://fr.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:26:11.779884",
      "language": "fr",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Metaphysics",
      "content": "Metaphysics is the branch of philosophy that examines the basic structure of reality. It is traditionally seen as the study of mind-independent features of the world, but some theorists view it as an inquiry into the conceptual framework of human understanding. Some philosophers, including Aristotle, designate metaphysics as first philosophy to suggest that it is more fundamental than other forms of philosophical inquiry.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Metaphysics",
      "timestamp": "2025-09-22T23:26:11.696146",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Aṣṭādhyāyī",
      "content": "The Aṣṭādhyāyī is a grammar text that describes a form of the Sanskrit language.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/A%E1%B9%A3%E1%B9%AD%C4%81dhy%C4%81y%C4%AB",
      "timestamp": "2025-09-22T23:26:11.615980",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Indian philosophy",
      "content": "Indian philosophy consists of philosophical traditions of the Indian subcontinent. The philosophies are often called darśana, meaning \"to see\" or \"looking at.\" Ānvīkṣikī means “critical inquiry” or “investigation.\" Unlike darśana, ānvīkṣikī was used to refer to Indian philosophies by classical Indian philosophers, such as Chanakya in the Arthaśāstra.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Indian_philosophy",
      "timestamp": "2025-09-22T23:26:11.680985",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Panini",
      "content": "Panini steht füreine Tribus aus der Familie der Menschenaffen, einzige Gattung dieser Tribus sind die Schimpansen\nitalienische Brötchen (Plural), siehe Panino\nitalienisches gegrilltes Sandwich: Panini (Sandwich)",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Panini",
      "timestamp": "2025-09-22T23:26:11.859145",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.65,
      "dhatu_potential": 0.0
    },
    {
      "title": "Upanishaden",
      "content": "Die Upanishaden sind eine Sammlung philosophischer Schriften des Hinduismus und Bestandteil des Veda. Sie wurden zwischen 700 und 200 v. Chr. niedergeschrieben. Der Singular lautet die Upanishad. Im Sanskrit bedeutet उपनिषद्, upaniṣad, f., wörtlich „das Sich-in-der-Nähe-Niedersetzen“, gemeint ist „sich zu Füßen eines Lehrers (Guru) setzen“, aber auch eine geheime, belehrende Sitzung. Die Upanishaden wurden am Ende in den Kanon der Veda aufgenommen.",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Upanishaden",
      "timestamp": "2025-09-22T23:26:11.700850",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.65,
      "dhatu_potential": 0.0
    },
    {
      "title": "Upanishad",
      "content": "Les Upanishad ou Upaniṣad sont un ensemble de textes philosophiques qui forment la base théorique de la religion hindoue. Elles constituent une partie des textes en Inde liés à la śruti et consistent en des spéculations philosophiques qui éclairent le texte auquel elles se réfèrent, chacune se réclamant d'une partie du Veda. Par exemple, la Kauṣītaki fait partie du cycle du Rig-Veda.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Upanishad",
      "timestamp": "2025-09-22T23:26:11.689574",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Upanishad",
      "content": "Se conoce como Upaniṣad a cada uno de los más de 200 libros sagrados hinduistas escritos en idioma sánscrito, de los cuales los más antiguos y representativos datarían aproximadamente de entre el 800 y el 400 a. C.",
      "source": "wikipedia_sanskrit_es",
      "url": "https://es.wikipedia.org/wiki/Upanishad",
      "timestamp": "2025-09-22T23:26:11.705734",
      "language": "es",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}