{
  "metadata": {
    "timestamp": "2025-09-22T23:54:15.101567",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 13,
    "avg_quality_score": 0.742,
    "avg_dhatu_potential": 0.015,
    "sources_used": [
      "wikipedia_linguistics",
      "wikipedia_sanskrit",
      "wikipedia_philosophy"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Grammar",
      "content": "In linguistics, grammar is the set of rules for how a natural language is structured, as demonstrated by its speakers or writers. Grammar rules may concern the use of clauses, phrases, and words. The term may also refer to the study of such rules, a subject that includes phonology, morphology, and syntax, together with phonetics, semantics, and pragmatics. There are, broadly speaking, two different ways to study grammar: traditional grammar and theoretical grammar.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Grammar",
      "timestamp": "2025-09-22T23:54:14.982189",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Philology",
      "content": "Philology is the study of language in oral and written historical sources. It is the intersection of textual criticism, literary criticism, history, and linguistics with strong ties to etymology. Philology is also defined as the study of literary texts and oral and written records, the establishment of their authenticity and their original form, and the determination of their meaning. A person who pursues this kind of study is known as a philologist. In older usage, especially British, philology is more general, covering comparative and historical linguistics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Philology",
      "timestamp": "2025-09-22T23:54:14.910573",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Logic",
      "content": "Logic is the study of correct reasoning. It includes both formal and informal logic. Formal logic is the study of deductively valid inferences or logical truths. It examines how conclusions follow from premises based on the structure of arguments alone, independent of their topic and content. Informal logic is associated with informal fallacies, critical thinking, and argumentation theory. Informal logic examines arguments expressed in natural language whereas formal logic uses formal language. When used as a countable noun, the term \"a logic\" refers to a specific logical formal system that articulates a proof system. Logic plays a central role in many fields, such as philosophy, mathematics, computer science, and linguistics.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Logic",
      "timestamp": "2025-09-22T23:54:14.931405",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.85,
      "dhatu_potential": 0.1
    },
    {
      "title": "Purana",
      "content": "Un purana (en sanskrit devanāgarī : पुराण est un texte appartenant à un vaste genre de la littérature indienne, traitant d'une grande gamme de sujets. Composés entre 400 et 1 000 de notre ère, ces récits élaborés pour tous étaient préférentiellement destinés aux femmes qui n'avaient pas accès aux Védas. Ils sont généralement écrits en sanskrit. Ce genre littéraire existe à la fois dans l'hindouisme et le jaïnisme. Souvent encyclopédiques, les puranas traitent à la fois des mythes religieux, des divinités hindoues, des légendes, des contes traditionnels et des histoires de rois, en y incluant des réflexions poussées sur la cosmogonie, la cosmologie, les généalogies, la médecine, l'astronomie, la théologie et la philosophie. Leur contenu peut être très contradictoire, chaque Purana ayant survécu dans de nombreux manuscrits eux-mêmes incompatibles. Les Puranas hindous sont anonymes, et probablement issus de nombreux auteurs qui se sont succédé au cours des siècles. La plupart des Puranas jaïns peuvent être datés et leurs auteurs retrouvés. Il y a 18 puranas majeurs et 18 puranas mineurs, considérés comme des Smriti.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Purana",
      "timestamp": "2025-09-22T23:54:15.032143",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Ramayana",
      "content": "Le Râmâyana, c'est-à-dire la « Geste de Rāma », est l'une des deux épopées mythologiques composées en langue sanskrite entre les IIIe siècle av. J.-C. et IIIe siècle de notre ère. Constitué de sept chapitres et 24 000 couplets (48 000 vers), c'est le plus court des deux textes et comme le Mahabharata est un des textes fondamentaux de l'hindouisme et de la mythologie hindoue. Le Râmâyana est traditionnellement attribué à l'ermite légendaire Vâlmîki, qui apparaît comme personnage dans les premier et dernier chapitres du poème, lesquels sont considérés comme des compositions un peu plus récentes que les autres.Il existe de nombreuses versions du Ramayana en langues indiennes, notamment des adaptations bouddhistes et jaïnes.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Ramayana",
      "timestamp": "2025-09-22T23:54:14.872182",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Vedas",
      "content": "The Vedas, sometimes collectively called the Veda, are a large body of religious texts originating in ancient India. Composed in Vedic Sanskrit, the texts constitute the oldest layer of Sanskrit literature and the oldest scriptures of Hinduism.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Vedas",
      "timestamp": "2025-09-22T23:54:15.063006",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Dhatu",
      "content": "Dhātu may refer to:Dhātu (ayurveda) – Sanskrit term for the seven fundamental elements of the body\nSkandha#Eighteen dhātus and four paramatthas – a Sanskrit technical term meaning realm or substrate in Buddhism\nA term used to denote the classical elements in Indian thought\nA Theravada Buddhist term for a stupa, a mound-like structure containing Buddhist relics\n\n",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Dhatu",
      "timestamp": "2025-09-22T23:54:14.912705",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Logic",
      "content": "Logic, de son vrai nom Sir Robert Bryson Hall II, né le 22 janvier 1990 à Gaithersburg dans le Maryland, est un rappeur américain.\nIl compte beaucoup de followers sur Internet et est membre du RattPack, un groupe d'amis avec lequel il travaille. Il publie officiellement quatre mixtapes, ainsi que trois albums studio. Membre des labels Visionary Music Group et Def Jam Records, il publie son premier album solo intitulé Under Pressure le 21 octobre 2014.",
      "source": "wikipedia_philosophy_fr",
      "url": "https://fr.wikipedia.org/wiki/Logic",
      "timestamp": "2025-09-22T23:54:14.936330",
      "language": "fr",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Philosophy of language",
      "content": "Philosophy of language refers to the philosophical study of the nature of language. It investigates the relationship between language, language users, and the world. Investigations may include inquiry into the nature of meaning, intentionality, reference, the constitution of sentences, concepts, learning, and thought.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Philosophy_of_language",
      "timestamp": "2025-09-22T23:54:14.893859",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Epistemology",
      "content": "\n\nEpistemology is the branch of philosophy that examines the nature, origin, and limits of knowledge. Also called \"the theory of knowledge\", it explores different types of knowledge, such as propositional knowledge about facts, practical knowledge in the form of skills, and knowledge by acquaintance as a familiarity through experience. Epistemologists study the concepts of belief, truth, and justification to understand the nature of knowledge. To discover how knowledge arises, they investigate sources of justification, such as perception, introspection, memory, reason, and testimony.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Epistemology",
      "timestamp": "2025-09-22T23:54:14.977758",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.1
    },
    {
      "title": "Indian philosophy",
      "content": "Indian philosophy consists of philosophical traditions of the Indian subcontinent. The philosophies are often called darśana, meaning \"to see\" or \"looking at.\" Ānvīkṣikī means “critical inquiry” or “investigation.\" Unlike darśana, ānvīkṣikī was used to refer to Indian philosophies by classical Indian philosophers, such as Chanakya in the Arthaśāstra.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Indian_philosophy",
      "timestamp": "2025-09-22T23:54:14.878315",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Ancient philosophy",
      "content": "This page lists some links to ancient philosophy, namely philosophical thought extending as far as early post-classical history.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Ancient_philosophy",
      "timestamp": "2025-09-22T23:54:14.961420",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Trishanku",
      "content": "Trishanku ist in der indischen Mythologie ein König von Ayodhya aus der Suryavamsha, der Sonnendynastie, Vater von Harishchandra, der mit Hilfe des Rishis Vishvamitra körperlich in den Himmel aufsteigen wollte.\nDer Vater von Trishanku Vater war Trayyaruna. Seine Frau war Satyaratha, eine Prinzessin aus dem Geschlecht der Kekaya.",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Trishanku",
      "timestamp": "2025-09-22T23:54:15.093711",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}