{
  "metadata": {
    "timestamp": "2025-09-22T23:56:16.628570",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 15,
    "avg_quality_score": 0.733,
    "avg_dhatu_potential": 0.007,
    "sources_used": [
      "wikipedia_linguistics",
      "wikipedia_sanskrit",
      "wikipedia_philosophy"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Grammar",
      "content": "In linguistics, grammar is the set of rules for how a natural language is structured, as demonstrated by its speakers or writers. Grammar rules may concern the use of clauses, phrases, and words. The term may also refer to the study of such rules, a subject that includes phonology, morphology, and syntax, together with phonetics, semantics, and pragmatics. There are, broadly speaking, two different ways to study grammar: traditional grammar and theoretical grammar.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Grammar",
      "timestamp": "2025-09-22T23:56:16.383616",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Semantics",
      "content": "Semantics is the study of linguistic meaning. It examines what meaning is, how words get their meaning, and how the meaning of a complex expression depends on its parts. Part of this process involves the distinction between sense and reference. Sense is given by the ideas and concepts associated with an expression while reference is the object to which an expression points. Semantics contrasts with syntax, which studies the rules that dictate how to create grammatically correct sentences, and pragmatics, which investigates how people use language in communication. Semantics, together with syntactics and pragmatics, is a part of semiotics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Semantics",
      "timestamp": "2025-09-22T23:56:16.537928",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Philology",
      "content": "Philology is the study of language in oral and written historical sources. It is the intersection of textual criticism, literary criticism, history, and linguistics with strong ties to etymology. Philology is also defined as the study of literary texts and oral and written records, the establishment of their authenticity and their original form, and the determination of their meaning. A person who pursues this kind of study is known as a philologist. In older usage, especially British, philology is more general, covering comparative and historical linguistics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Philology",
      "timestamp": "2025-09-22T23:56:16.493205",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sanskrit",
      "content": "Sanskrit is a classical language belonging to the Indo-Aryan branch of the Indo-European languages. It arose in northwest South Asia after its predecessor languages had diffused there from the northwest in the late Bronze Age. Sanskrit is the sacred language of Hinduism, the language of classical Hindu philosophy, and of historical texts of Buddhism and Jainism. It was a link language in ancient and medieval South Asia, and upon transmission of Hindu and Buddhist culture to Southeast Asia, East Asia and Central Asia in the early medieval era, it became a language of religion and high culture, and of the political elites in some of these regions. As a result, Sanskrit had a lasting effect on the languages of South Asia, Southeast Asia and East Asia, especially in their formal and learned vocabularies.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:56:16.467731",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Historical linguistics",
      "content": "Historical linguistics, also known as diachronic linguistics, is the scientific study of how languages change over time. It seeks to understand the nature and causes of linguistic change and to trace the evolution of languages. Historical linguistics involves several key areas of study, including the reconstruction of ancestral languages, the classification of languages into families, and the analysis of the cultural and social influences on language development.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Historical_linguistics",
      "timestamp": "2025-09-22T23:56:16.419960",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Sanskrit",
      "content": "Le sanskrit ou sanscrit est une langue indo-européenne de la famille indo-aryenne, encore parlée dans le sous-continent indien bien que par une minorité. De nos jours, elle est encore parlée dans quelques villages et par certains érudits qui publient des œuvres universitaires ou tiennent des colloques en sanskrit.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Sanskrit",
      "timestamp": "2025-09-22T23:56:16.457744",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Mahabharata",
      "content": "Le Mahabharata est une épopée sanskrite (itihâsa) de la mythologie hindoue comportant, selon le décompte de Vyâsa, 81 936 strophes (shlokas) réparties en dix-huit livres (parvan). Il est considéré comme le plus long poème jamais composé.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Mahabharata",
      "timestamp": "2025-09-22T23:56:16.609673",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Vedas",
      "content": "The Vedas, sometimes collectively called the Veda, are a large body of religious texts originating in ancient India. Composed in Vedic Sanskrit, the texts constitute the oldest layer of Sanskrit literature and the oldest scriptures of Hinduism.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Vedas",
      "timestamp": "2025-09-22T23:56:16.512371",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Epistemology",
      "content": "\n\nEpistemology is the branch of philosophy that examines the nature, origin, and limits of knowledge. Also called \"the theory of knowledge\", it explores different types of knowledge, such as propositional knowledge about facts, practical knowledge in the form of skills, and knowledge by acquaintance as a familiarity through experience. Epistemologists study the concepts of belief, truth, and justification to understand the nature of knowledge. To discover how knowledge arises, they investigate sources of justification, such as perception, introspection, memory, reason, and testimony.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Epistemology",
      "timestamp": "2025-09-22T23:56:16.471431",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.1
    },
    {
      "title": "Indian philosophy",
      "content": "Indian philosophy consists of philosophical traditions of the Indian subcontinent. The philosophies are often called darśana, meaning \"to see\" or \"looking at.\" Ānvīkṣikī means “critical inquiry” or “investigation.\" Unlike darśana, ānvīkṣikī was used to refer to Indian philosophies by classical Indian philosophers, such as Chanakya in the Arthaśāstra.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Indian_philosophy",
      "timestamp": "2025-09-22T23:56:16.392122",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Aṣṭādhyāyī",
      "content": "The Aṣṭādhyāyī is a grammar text that describes a form of the Sanskrit language.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/A%E1%B9%A3%E1%B9%AD%C4%81dhy%C4%81y%C4%AB",
      "timestamp": "2025-09-22T23:56:16.388564",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Metaphysics",
      "content": "Metaphysics is the branch of philosophy that examines the basic structure of reality. It is traditionally seen as the study of mind-independent features of the world, but some theorists view it as an inquiry into the conceptual framework of human understanding. Some philosophers, including Aristotle, designate metaphysics as first philosophy to suggest that it is more fundamental than other forms of philosophical inquiry.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Metaphysics",
      "timestamp": "2025-09-22T23:56:16.428448",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Mahabharata",
      "content": "The Mahābhārata is a smriti text from ancient India, one of the two important epics of Hinduism known as the Itihasas, the other being the Ramayana. It narrates the events and aftermath of the Kurukshetra War, a war of succession between two groups of princely cousins, the Kauravas and the Pāṇḍavas. It contains philosophical and devotional material, such as a discussion of the four \"goals of life\" or puruṣārtha (12.161). Among the principal works and stories in the Mahābhārata are the Bhagavad Gita, the story of Damayanti, the story of Shakuntala, the story of Pururava and Urvashi, the story of Savitri and Satyavan, the story of Kacha and Devayani, the story of Rishyasringa and an abbreviated version of the Rāmāyaṇa, often considered as works in their own right.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Mahabharata",
      "timestamp": "2025-09-22T23:56:16.597748",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.6,
      "dhatu_potential": 0.0
    },
    {
      "title": "Morphology",
      "content": "Morphology, from the Greek and meaning \"study of shape\", may refer to:",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Morphology",
      "timestamp": "2025-09-22T23:56:16.461088",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.5499999999999999,
      "dhatu_potential": 0.0
    },
    {
      "title": "Trishanku",
      "content": "Trishanku ist in der indischen Mythologie ein König von Ayodhya aus der Suryavamsha, der Sonnendynastie, Vater von Harishchandra, der mit Hilfe des Rishis Vishvamitra körperlich in den Himmel aufsteigen wollte.\nDer Vater von Trishanku Vater war Trayyaruna. Seine Frau war Satyaratha, eine Prinzessin aus dem Geschlecht der Kekaya.",
      "source": "wikipedia_sanskrit_de",
      "url": "https://de.wikipedia.org/wiki/Trishanku",
      "timestamp": "2025-09-22T23:56:16.533554",
      "language": "de",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}