{
  "metadata": {
    "timestamp": "2025-09-22T23:52:34.652884",
    "collector": "turbo_corpus_collector",
    "version": "1.0",
    "count": 15,
    "avg_quality_score": 0.773,
    "avg_dhatu_potential": 0.02,
    "sources_used": [
      "wikipedia_linguistics",
      "wikipedia_sanskrit",
      "wikipedia_philosophy"
    ],
    "processing_speed": "turbo"
  },
  "documents": [
    {
      "title": "Syntax",
      "content": "In linguistics, syntax is the study of how words and morphemes combine to form larger units such as phrases and sentences. Central concerns of syntax include word order, grammatical relations, hierarchical sentence structure (constituency), agreement, the nature of crosslinguistic variation, and the relationship between form and meaning (semantics). Diverse approaches, such as generative grammar and functional grammar, offer unique perspectives on syntax, reflecting its complexity and centrality to understanding human language.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:52:34.427394",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Vyākaraṇa",
      "content": "Vyākaraṇa refers to one of the six ancient Vedangas, ancillary science connected with the Vedas, which are scriptures in Hinduism. Vyākaraṇa is the study of grammar and linguistic analysis in Sanskrit language.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Vy%C4%81kara%E1%B9%87a",
      "timestamp": "2025-09-22T23:52:34.432236",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 1.0,
      "dhatu_potential": 0.0
    },
    {
      "title": "Semantics",
      "content": "Semantics is the study of linguistic meaning. It examines what meaning is, how words get their meaning, and how the meaning of a complex expression depends on its parts. Part of this process involves the distinction between sense and reference. Sense is given by the ideas and concepts associated with an expression while reference is the object to which an expression points. Semantics contrasts with syntax, which studies the rules that dictate how to create grammatically correct sentences, and pragmatics, which investigates how people use language in communication. Semantics, together with syntactics and pragmatics, is a part of semiotics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Semantics",
      "timestamp": "2025-09-22T23:52:34.457084",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Ashtadhyayi",
      "content": "Ashtadhyayi est un traité de grammaire en huit chapitres composé en sanskrit entre les VIe et Ve siècles av. J.-C., et attribué au célèbre grammairien indien Pāṇini. Ce traité en huit partie comprend 3 996 règles composées dans le style du sūtra, et il est le plus ancien connu à ce jour. L'Aṣṭādhyāyī est accompagné de trois autres traités, généralement attribués à Panini.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Ashtadhyayi",
      "timestamp": "2025-09-22T23:52:34.623314",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Dhātu",
      "content": "Dhātu est un mot sanskrit signifiant élément, partie d'un tout; racine verbale. Dans le bouddhisme ce sont les quatre éléments physiques (bhūta) constitutifs de la matière. Leur analyse englobe les phénomènes physiques et partiellement mentaux sous forme de dix-huit éléments. En grammaire sanskrite, le terme désigne les racines verbales.",
      "source": "wikipedia_sanskrit_fr",
      "url": "https://fr.wikipedia.org/wiki/Dh%C4%81tu",
      "timestamp": "2025-09-22T23:52:34.489670",
      "language": "fr",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.9,
      "dhatu_potential": 0.1
    },
    {
      "title": "Philology",
      "content": "Philology is the study of language in oral and written historical sources. It is the intersection of textual criticism, literary criticism, history, and linguistics with strong ties to etymology. Philology is also defined as the study of literary texts and oral and written records, the establishment of their authenticity and their original form, and the determination of their meaning. A person who pursues this kind of study is known as a philologist. In older usage, especially British, philology is more general, covering comparative and historical linguistics.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Philology",
      "timestamp": "2025-09-22T23:52:34.535044",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.9,
      "dhatu_potential": 0.0
    },
    {
      "title": "Historical linguistics",
      "content": "Historical linguistics, also known as diachronic linguistics, is the scientific study of how languages change over time. It seeks to understand the nature and causes of linguistic change and to trace the evolution of languages. Historical linguistics involves several key areas of study, including the reconstruction of ancestral languages, the classification of languages into families, and the analysis of the cultural and social influences on language development.",
      "source": "wikipedia_linguistics_en",
      "url": "https://en.wikipedia.org/wiki/Historical_linguistics",
      "timestamp": "2025-09-22T23:52:34.490820",
      "language": "en",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Dhatu",
      "content": "Dhātu may refer to:Dhātu (ayurveda) – Sanskrit term for the seven fundamental elements of the body\nSkandha#Eighteen dhātus and four paramatthas – a Sanskrit technical term meaning realm or substrate in Buddhism\nA term used to denote the classical elements in Indian thought\nA Theravada Buddhist term for a stupa, a mound-like structure containing Buddhist relics\n\n",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/Dhatu",
      "timestamp": "2025-09-22T23:52:34.480870",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Syntax",
      "content": "Syntax est un groupe de musique britannique basé à Londres. Formé autour des musiciens Jan Burton et Mike Tournier, le groupe emprunte sa musique comme un son Rock en fusionnant l'Electro et le Trip hop. Ils ont participé à plusieurs projets musicaux comme dans une apparition dans la B.O du jeu vidéo Driver 3, en plus de leurs divers projets individuels comme leur album Meccano Mind sorti en 2004.",
      "source": "wikipedia_linguistics_fr",
      "url": "https://fr.wikipedia.org/wiki/Syntax",
      "timestamp": "2025-09-22T23:52:34.434552",
      "language": "fr",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.75,
      "dhatu_potential": 0.0
    },
    {
      "title": "Epistemology",
      "content": "\n\nEpistemology is the branch of philosophy that examines the nature, origin, and limits of knowledge. Also called \"the theory of knowledge\", it explores different types of knowledge, such as propositional knowledge about facts, practical knowledge in the form of skills, and knowledge by acquaintance as a familiarity through experience. Epistemologists study the concepts of belief, truth, and justification to understand the nature of knowledge. To discover how knowledge arises, they investigate sources of justification, such as perception, introspection, memory, reason, and testimony.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Epistemology",
      "timestamp": "2025-09-22T23:52:34.449742",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.1
    },
    {
      "title": "Indian philosophy",
      "content": "Indian philosophy consists of philosophical traditions of the Indian subcontinent. The philosophies are often called darśana, meaning \"to see\" or \"looking at.\" Ānvīkṣikī means “critical inquiry” or “investigation.\" Unlike darśana, ānvīkṣikī was used to refer to Indian philosophies by classical Indian philosophers, such as Chanakya in the Arthaśāstra.",
      "source": "wikipedia_philosophy_en",
      "url": "https://en.wikipedia.org/wiki/Indian_philosophy",
      "timestamp": "2025-09-22T23:52:34.518201",
      "language": "en",
      "topic_category": "wikipedia_philosophy",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Aṣṭādhyāyī",
      "content": "The Aṣṭādhyāyī is a grammar text that describes a form of the Sanskrit language.",
      "source": "wikipedia_sanskrit_en",
      "url": "https://en.wikipedia.org/wiki/A%E1%B9%A3%E1%B9%AD%C4%81dhy%C4%81y%C4%AB",
      "timestamp": "2025-09-22T23:52:34.617196",
      "language": "en",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.7,
      "dhatu_potential": 0.0
    },
    {
      "title": "Verb",
      "content": "Das Verb, deutsch auch Zeitwort, Tätigkeitswort und im Schulgebrauch unterer Klassen Tu(n)wort, ist in der Grammatik eine Wortart. Die Trennung zwischen Verb und Substantiv wird als die fundamentalste Unterscheidung im Bereich der Wortarten angesehen, da hierin die Aufteilung elementarer Sätze in das Prädikat und sein Subjekt angelegt ist. Bei Autoren der Antike wurden anfangs Bezeichnungen für „Verb“ und „Prädikat“ auch nicht eindeutig unterschieden.",
      "source": "wikipedia_linguistics_de",
      "url": "https://de.wikipedia.org/wiki/Verb",
      "timestamp": "2025-09-22T23:52:34.573762",
      "language": "de",
      "topic_category": "wikipedia_linguistics",
      "quality_score": 0.65,
      "dhatu_potential": 0.1
    },
    {
      "title": "Upanishad",
      "content": "Se conoce como Upaniṣad a cada uno de los más de 200 libros sagrados hinduistas escritos en idioma sánscrito, de los cuales los más antiguos y representativos datarían aproximadamente de entre el 800 y el 400 a. C.",
      "source": "wikipedia_sanskrit_es",
      "url": "https://es.wikipedia.org/wiki/Upanishad",
      "timestamp": "2025-09-22T23:52:34.560431",
      "language": "es",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    },
    {
      "title": "Astadhiai",
      "content": "El Aṣṭādhyāyī es un texto sobre la gramática del sánscrito compuesto por el lingüista indio Pāṇini. Estos ocho libros contienen unos 8000 sutras o ‘aforismos’, cuyo encadenamiento posee un notable rigor.",
      "source": "wikipedia_sanskrit_es",
      "url": "https://es.wikipedia.org/wiki/Astadhiai",
      "timestamp": "2025-09-22T23:52:34.651070",
      "language": "es",
      "topic_category": "wikipedia_sanskrit",
      "quality_score": 0.5,
      "dhatu_potential": 0.0
    }
  ]
}